#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
tls_private_key.rsa_key: Refreshing state... [id=b50d9eb9139c84be2668fc82ef8bb024a001fcf4]
local_file.tfkey: Refreshing state... [id=852cf5e1705ff69dae9015e73c5f66c855625b31]
aws_key_pair.terraform_key: Refreshing state... [id=terraform_key]
aws_vpc.main: Refreshing state... [id=vpc-020fd250c21de9282]
data.aws_ami.java-ami: Reading...
aws_eip.nat_gateway: Refreshing state... [id=eipalloc-074e3a8883cbdf3ea]
data.aws_ami.java-ami: Read complete after 0s [id=ami-08a1f9554dc567c5c]
aws_security_group.elb: Refreshing state... [id=sg-0522cd3314d25047d]
aws_subnet.privatesubnet_1: Refreshing state... [id=subnet-04cce3cd2b54c39af]
aws_subnet.publicsubnet_2: Refreshing state... [id=subnet-0ff9260a8cfec24f1]
aws_subnet.privatesubnet_3: Refreshing state... [id=subnet-072e8a1e7fb23cefc]
aws_subnet.privatesubnet_4: Refreshing state... [id=subnet-0e0ab3cdbd047fc08]
aws_subnet.publicsubnet_1: Refreshing state... [id=subnet-00c257867edbbfa6b]
aws_security_group.allow_http: Refreshing state... [id=sg-0f3cdde99cf7b3013]
aws_security_group.allow_ssh: Refreshing state... [id=sg-0c786839219ee3224]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-09699024afc71d92e]
aws_subnet.privatesubnet_2: Refreshing state... [id=subnet-0515db54f536b786d]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-0fc3cbd1957ccb0a3]
aws_elb.elastic-load-balancer: Refreshing state... [id=ELB]
aws_db_subnet_group.db-subnet-group: Refreshing state... [id=db-subnet-group]
aws_instance.bastion-host: Refreshing state... [id=i-054665ff6aa898018]
aws_route_table.private_route_table: Refreshing state... [id=rtb-0b23c7279ae8db552]
aws_route_table.public_route_table: Refreshing state... [id=rtb-090ebd186c08cf960]
aws_launch_template.ec2_config: Refreshing state... [id=lt-04d9d9186039ab52c]
aws_route_table_association.private_route_table_association_1: Refreshing state... [id=rtbassoc-00edafed1d513caaa]
aws_route_table_association.public_route_table_association_1: Refreshing state... [id=rtbassoc-002cac0a03151f596]
aws_route_table_association.private_route_table_association_3: Refreshing state... [id=rtbassoc-032acb8465b10ca9c]
aws_route_table_association.public_route_table_association_2: Refreshing state... [id=rtbassoc-009d90808b07b428b]
aws_route_table_association.private_route_table_association_4: Refreshing state... [id=rtbassoc-007176daa0ca444d4]
aws_route_table_association.private_route_table_association_2: Refreshing state... [id=rtbassoc-08fdc8bf9446e6582]
aws_autoscaling_group.auto_scaling_group: Refreshing state... [id=Auto Scaling Group]
aws_db_instance.postgres-db: Refreshing state... [id=terraform-20230306184044350800000003]
aws_autoscaling_attachment.asg_attachment: Refreshing state... [id=Auto Scaling Group-20230306184131302000000006]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_autoscaling_group.auto_scaling_group will be updated in-place
  ~ resource "aws_autoscaling_group" "auto_scaling_group" {
        id                        = "Auto Scaling Group"
      ~ load_balancers            = [
          - "ELB",
        ]
        name                      = "Auto Scaling Group"
        # (22 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-04d9d9186039ab52c"
            name    = "terraform-20230306184044338200000001"
          ~ version = "1" -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # aws_launch_template.ec2_config will be updated in-place
  ~ resource "aws_launch_template" "ec2_config" {
      ~ default_version         = 1 -> (known after apply)
        id                      = "lt-04d9d9186039ab52c"
      ~ image_id                = "ami-0be9779f3a68a622a" -> "ami-08a1f9554dc567c5c"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "terraform-20230306184044338200000001"
        tags                    = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # local_file.tfkey will be created
  + resource "local_file" "tfkey" {
      + content              = (sensitive value)
      + directory_permission = "0777"
      + file_permission      = "400"
      + filename             = "tfkey"
      + id                   = (known after apply)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @ludicsa, Action: `pull_request`*